[{"aries":{"desc":"Control your temper by understanding the feelings of your family. Investment made today will enhance your prosperity and financial security. Rituals will be performed at home. You will cherish the spice of exotica in your sweet love life today. Outstation travel will not be comfortable-but will help build important contacts. Married couples live togther, but it is not always romantic. Hence today, it is going to be really really romantic. Entertaining too many guests may ruin your weekend mood. But cheer up, as you might meet a lot of old friends too.Your Lucky Number today is 5","write":"\nControl your temper by understanding the feelings of your family. Investment made today will enhance your prosperity and financial security. Rituals will be performed at home. You will cherish the spice of exotica in your sweet love life today. Outstation travel will not be comfortable-but will help build important contacts. Married couples live togther, but it is not always romantic. Hence today, it is going to be really really romantic. Entertaining too many guests may ruin your weekend mood. But cheer up, as you might meet a lot of old friends too.Lucky Number: 5 ..."}},{"taurus":{"desc":"Your kind nature will bring many happy moments today. Use your innovative idea to make some extra money.  Unexpected gifts and presents from relatives and friends.   You will know today that the love of your partner is truly soulful for you. Stay away from gossip and rumours.  Things are really beautiful today in your married life. Plan a wonderful evening for your spouse. It obviously feels a bit frustrating when your family members force you to do something or the other during weekend. Though, avoiding getting angry is in your interest.Your Lucky Number today is 4","write":"\nYour kind nature will bring many happy moments today. Use your innovative idea to make some extra money.  Unexpected gifts and presents from relatives and friends.   You will know today that the love of your partner is truly soulful for you. Stay away from gossip and rumours.  Things are really beautiful today in your married life. Plan a wonderful evening for your spouse. It obviously feels a bit frustrating when your family members force you to do something or the other during weekend. Though, avoiding getting angry is in your interest.Lucky Number: 4 ..."}},{"gemini":{"desc":"Your are likely to enjoy the success of other people by praising them. Incase you are looking for ways to make little extra money- invest in secure financial schemes. Devote your spare time in selfless service. It will give happiness and tremendous joy to you and your family. You will feel the love of your sweetheart all around you today. It is a beautiful lovely day. Travel plans if any-might get postponed due to last minute changes in your schedule. Love and good food are the basics of married life; and you are going to experience the best of it today. Watching TV throughout the day is nothing but an overdose of entertainment. It might strain your eyes severely.Your Lucky Number today is 2","write":"\nYour are likely to enjoy the success of other people by praising them. Incase you are looking for ways to make little extra money- invest in secure financial schemes. Devote your spare time in selfless service. It will give happiness and tremendous joy to you and your family. You will feel the love of your sweetheart all around you today. It is a beautiful lovely day. Travel plans if any-might get postponed due to last minute changes in your schedule. Love and good food are the basics of married life; and you are going to experience the best of it today. Watching TV throughout the day is ..."}},{"cancer":{"desc":"Your doubting nature may show you the face of defeat. Good day for real estate and financial transactions. You should take a break from your daily schedule and go out with your friends today. Control your passion it may put your love affair in jeopardy. A sparkling laughter filled day when most things proceed-as you desire. You might get stressed due to the decrementing health of your spouse today. Feeling lonely is troubling at times, especially on the days when you do not have much to do. Try to brush it aside and have great time with your friends.Your Lucky Number today is 5","write":"\nYour doubting nature may show you the face of defeat. Good day for real estate and financial transactions. You should take a break from your daily schedule and go out with your friends today. Control your passion it may put your love affair in jeopardy. A sparkling laughter filled day when most things proceed-as you desire. You might get stressed due to the decrementing health of your spouse today. Feeling lonely is troubling at times, especially on the days when you do not have much to do. Try to brush it aside and have great time with your friends.Lucky Number: 5 ..."}},{"leo":{"desc":"You will find people around you highly demanding-Don't promise more than you can deliver- and don't stress yourself to exhaustion just to please others. Although your financial position improves but the outflow of money will still create hindrance in executing your projects. Your unnecessary finding faults in others could be criticised by relatives. You must realize that it is only wastage of time. You don?t gain anything from this. Better to change your habit. Don't waste your time in finding fault in your beloved. Today you will find yourself in the spotlight when assistance you gave to someone else is rewarded or acknowledged. Just don't complain about anything to your spouse, he\/she is already in a bad mood. It might become a bad day. It might be somewhat boring day; you may make it interesting be doing something different and creative.Your Lucky Number today is 4","write":"\nYou will find people around you highly demanding-Don't promise more than you can deliver- and don't stress yourself to exhaustion just to please others. Although your financial position improves but the outflow of money will still create hindrance in executing your projects. Your unnecessary finding faults in others could be criticised by relatives. You must realize that it is only wastage of time. You don?t gain anything from this. Better to change your habit. Don't waste your time in finding fault in your beloved. Today you will find yourself in the spotlight when assistance you gave to ..."}},{"virgo":{"desc":"Make your life more sublime to enjoy the richer grandeur of infinite life. Absence of worry is the first step in this direction. Financial gains-which were expected today-get delayed. Help from family members take care of your needs. Be cheerful and courage to face downs in love. Do not feel shy when asked for your opinion-as you will be highly appreciated for it. Your spouse might come under the adverse influence of others and fight with you, but your love and compassion will settle everything down. It is better to miss your love than to meet him\/her today, as meeting might end up in a tiff.Your Lucky Number today is 2","write":"\nMake your life more sublime to enjoy the richer grandeur of infinite life. Absence of worry is the first step in this direction. Financial gains-which were expected today-get delayed. Help from family members take care of your needs. Be cheerful and courage to face downs in love. Do not feel shy when asked for your opinion-as you will be highly appreciated for it. Your spouse might come under the adverse influence of others and fight with you, but your love and compassion will settle everything down. It is better to miss your love than to meet him\/her today, as meeting might end up in a ..."}},{"libra":{"desc":"Today you will have ample of the time to do things to improve your health and looks Avoid overspending and dubious financial schemes. This is not the day to dominate or do things that might start some trouble. Personal affairs will be under control. Today people will pass compliments-which you have always wanted to hear. Today, your better half will support you in the most critical thing of your life. An unwanted guest may gobble up all your time, so beware.Your Lucky Number today is 5","write":"\nToday you will have ample of the time to do things to improve your health and looks Avoid overspending and dubious financial schemes. This is not the day to dominate or do things that might start some trouble. Personal affairs will be under control. Today people will pass compliments-which you have always wanted to hear. Today, your better half will support you in the most critical thing of your life. An unwanted guest may gobble up all your time, so beware.Lucky Number: 5\n ..."}},{"scorpio":{"desc":"You need to sit back and relax today- and get involved in hobbies and things that you enjoy doing the most. You will have problems hanging on to your money today- You are likely to overspend or misplace your wallet-  Some losses due to carelessness are certain.  Wife would help in changing your life. Make yourself a livewire who loves to fashion his life with his own effort and work rather than look for crutches and lean on others. You need to be in your best behaviour- because it won't take much to upset your lover today. Today there will be lot of issues- which need immediate attention. You might fight with your spouse today out of your own stress and actually of no reason. A day to catch up with your friends who you have not met for a long time. But inform your friend in advance if you want to meet, or a lot of time might be wasted.Your Lucky Number today is 6","write":"\nYou need to sit back and relax today- and get involved in hobbies and things that you enjoy doing the most. You will have problems hanging on to your money today- You are likely to overspend or misplace your wallet-  Some losses due to carelessness are certain.  Wife would help in changing your life. Make yourself a livewire who loves to fashion his life with his own effort and work rather than look for crutches and lean on others. You need to be in your best behaviour- because it won't take much to upset your lover today. Today there will be lot of issues- which need immediate attention. ..."}},{"sagittarius":{"desc":"You will have abundance of energy- but work pressure seems to get you irritated. Investment needs to be made with a long-term perspective.  Children might seek your help to complete school projects. Love will show positive vibes Favourable planets will bring you plenty of reasons to feel pleased today. Your married life is all about fun, pleasure, and bliss today. You might visit different malls or shopping complexes with your family. However, it may significantly increase your expenditure too.Your Lucky Number today is 3","write":"\nYou will have abundance of energy- but work pressure seems to get you irritated. Investment needs to be made with a long-term perspective.  Children might seek your help to complete school projects. Love will show positive vibes Favourable planets will bring you plenty of reasons to feel pleased today. Your married life is all about fun, pleasure, and bliss today. You might visit different malls or shopping complexes with your family. However, it may significantly increase your expenditure too.Lucky Number: 3\n ..."}},{"capricorn":{"desc":"Listen to some soothing music to get rid of tension. Don't overspend too much in order to impress others. For some- a new arrival in the family brings in moments for celebration and party.  Romance- outings and parties may prove to be exciting but very tiring.  Today you will find yourself in the spotlight when assistance you gave to someone else is rewarded or acknowledged. Unending love and support of your partner will strengthen the bond of you too. You might feel lazy during the first half of the day, but a lot can be done if you muster the courage to step out of your home.Your Lucky Number today is 3","write":"\nListen to some soothing music to get rid of tension. Don't overspend too much in order to impress others. For some- a new arrival in the family brings in moments for celebration and party.  Romance- outings and parties may prove to be exciting but very tiring.  Today you will find yourself in the spotlight when assistance you gave to someone else is rewarded or acknowledged. Unending love and support of your partner will strengthen the bond of you too. You might feel lazy during the first half of the day, but a lot can be done if you muster the courage to step out of your ..."}},{"aquarius":{"desc":"Meditation and yoga should be practiced for spiritual as well as physical gains.  You could find yourself in an exciting new situation-which will also bring you financial gains.  Invitation in a award function of your child would be the source of happiness. You would likely to see your dream coming true as he lives upto your expectations. Sudden romantic encounter will lift your spirits.  Watch out for individual who might try to mislead you or give you information that might cause you some harm. A personal space is important in married life, but today you will just try to be close to each other. The romance is on fire! Getting stuck in someone’s company that you do not enjoy much might irritate you. So, choose wisely who you go out with.Your Lucky Number today is 1","write":"\nMeditation and yoga should be practiced for spiritual as well as physical gains.  You could find yourself in an exciting new situation-which will also bring you financial gains.  Invitation in a award function of your child would be the source of happiness. You would likely to see your dream coming true as he lives upto your expectations. Sudden romantic encounter will lift your spirits.  Watch out for individual who might try to mislead you or give you information that might cause you some harm. A personal space is important in married life, but today you will just try to be close to each ..."}},{"pisces":{"desc":"Hasty decision could cause some problem. Think calmly\/coolly before taking any decision. Today you should focus on issues related to land, real estate, or cultural projects. An old friend makes an unexpected visit bringing back pleasant memories. Someone may compliment you. Boundless creativity and enthusiasm leads you to another beneficial day. After a difficult phase in married life, you will see the sunshine today. You might feel lazy during the first half of the day, but a lot can be done if you muster the courage to step out of your home.Your Lucky Number today is 8","write":"\nHasty decision could cause some problem. Think calmly\/coolly before taking any decision. Today you should focus on issues related to land, real estate, or cultural projects. An old friend makes an unexpected visit bringing back pleasant memories. Someone may compliment you. Boundless creativity and enthusiasm leads you to another beneficial day. After a difficult phase in married life, you will see the sunshine today. You might feel lazy during the first half of the day, but a lot can be done if you muster the courage to step out of your home.Lucky Number: 8 ..."}}]